{"review":"Genius or utter madness? That depends on your interpretation of this film. I responded to it on the level of a self-aware \"cop-movie parody\", and I sincerely hope that was the intention as I don't see anyone taking it seriously! :-D Paul Rudd for one seems to be chewing up the scenery and really getting into the spirit of things! Is this film supposed to mark a departure for Rudd from his core background in the comedy genre? Some kind of insane attempt to reinvent him as a hard-boiled action star? I think not! <br \/><br \/>With the cheesy, almost awkward acting, low budget FX, and zany over-the-top action set pieces, it all kinda evoked that old TV show \"Sledge Hammer\" for me! HILARIOUS!!! :-)<br \/><br \/>Of course, I may have totally interpreted the film wrong. If it was in fact an attempt at a 'straight' action movie, then it was certainly an amusing failure!!<br \/><br \/>Watch with lots of alcohol and some mates!!! ;-)","label":1,"predicted":0}
{"review":"This the the final feature film that Michelangelo Antonioni directed, with the help of Wim Wenders, and adapts from his short story collection \"That Bowling Alley on the Tiber\". Beyond the Clouds contain 4 short stories with familiar themes that we've come to be accustomed to from his earlier works, and sums up those themes in vignettes which are weaved together via Wenders' directed scenes involving John Malkovich's The Director character. However, most of the stories seemed to offer little or no depth that we're used to from an Antonioni movie, while Malkovich's narration of supposed depth rattled on with unclear diction that sounded a tad pretentious and out of place.<br \/><br \/>Nonetheless, all four stories seem to touch on chance encounters, and extremely quick romances that played out more like lust at first sight, perhaps due to the lack of time (since they're short stories anyway) to allow for a more layered approach to carefully define and craft the characters as we know from a typical Antonioni movie. And the obsessive approach here is for the characters to disrobe to showcase a lack of deeper connection sacrificed for the immediate satisfaction of the flesh. Maybe this is the point to want to bring across with an observation of the more modern relationship?<br \/><br \/>The first story, Story of a Love Affair That Never Existed, tells the romance between Silvano (Kim Rossi Stuart) and Carmen (Ines Sastre), who meet when one asks the other for directions to a hotel, and later meet at a cafe. It's as if Fate is playing games on them when they meet, but part and meet again much later, but like the games people play, it's almost like a L'Avventura or a La Notte with the lack of communication, and of the expectations from the man.<br \/><br \/>John Malkovich's director character takes central role in the next short, who exhibited some really lecherous looks toward a girl working at a shop, played by Sophie Marceau. She is deeply disturbed and made to feel uncomfortable, but somehow plucked up the courage to approach him, and in what I thought was to scare him off, tells him her background that she murdered her father by stabbing him 12 times. But in a flash these two are off toward bedroom gymnastics.<br \/><br \/>The next short, Don't Look for Me, is the longest of the lot, with Peter Weller playing a cheating husband who has to choose between his mistress (Chiara Caselli) or his wife, played by Fanny Ardant. Perhaps the more star studded of the lot, with Jean Reno also stepping in for a coda at the end of it, which sort of expands the little universe in which this short exists. But unfortunately Reno's involvement also got relegated to some stifle of laughter as it goes into the implausible domain with laser quick romantic tanglements. There was a key element adapted from L'Eclisse with a kiss between a couple through a glass panel too, while the introductory tale about the story of souls was quite interesting. If there's a negative theme here this short wants to play upon, it'll be the duplicity of man.<br \/><br \/>In between this short and the next was a small scene which reunited our couple from La Notte, Marcello Mastroianni and Jeanne Moreau, where the former was painting a landscape which was reminiscent of that in Red Desert. Finally, we have the final shot This Body of Dirt, with Vincent Perez as a young man going after a girl (Irene Jacob) whom he just met, and falling in love with her, only to realize that it is a love that is too late. It's a relatively talkie piece, just like the first story, with the characters engaging in conversation while walking the streets of the city they're in, which sort of brings to mind Richard Linklater's Before Sunrise.<br \/><br \/>While on the whole the movie may have succeeded as individual pieces, they never quite measure up as a combined effort given the \"excuse\" to link them up was a film director's exploration of possible stories and a look for inspiration for his next film.","label":1,"predicted":0}
{"review":"This one is one of those classic B movie following the exploits of 2 hobos. It's done really cheesily and Big Stupid running off one-liners like a cardboard cassanova. But Jack Elam steals every scene he's in as the creepazoid Jesse (now Jerome!). My favorite scene is the lynch mob and the dad's voice going up 10 octaves (\"You loved her?\"). Danny, Big Stupid's protege, is surprisingly stupider, but not as loathsome as our lead star. There's also a quaint scene of a guy pimping at the diner. Joyce Meadows is the sweet, naive nice gal and probably the least annoying. And those yellow ruffles (RAWR!). Oh, and booze is evil according to Mr. Stupid.<br \/><br \/>This movie's a hoot. Watch the MST cover of this and Crow's terrific Elam homage!","label":0,"predicted":1}
{"review":"Basically an endearingly chintzy and moronic $1.50 version of the nifty early 80's subterranean creature feature favorite \"The Boogens,\" this entertainingly schlocky cheapie centers on a nasty, squirmy, wriggling monster who makes an instant meal out of any unfortunate souls foolhardy enough to go poking around the notoriously off limits Gold Spike Mine. Your standard-issue motley assortment of intrepid boneheads -- hectoring hard-nosed mine boss, cute, but insipid blonde babe, feisty lady geologist, boozy, inexplicably Aussie-accented (!) seasoned old mine hand, charmless doofus, hunky, jolly guy, and, arguably the most annoying character of the uniformly irritating bunch, a nerdy bespectacled aspiring writer dweeb who's prone to speaking in flowery, melodramatic utterances -- trek into the dark, uninviting cave in search of gold. Naturally, these intensely insufferable imbeciles discover that the allegedly abandoned mine is the home of a deadly, ugly, multi-tentacled beast who in time honored hoary B-flick fashion proceeds to gruesomely bag the group one at a time. Directed, co-written, co-produced and co-edited with dumbfounding maladroitness by Melanie Anne Phillips, acted with dismaying flatness by a rank no-name cast, further marred by lethargic pacing, a drably meandering narrative, murky, under-lit, eye-straining cinematography, a shivery, redundantly thudding pseudo-John Carpenter synthesizer score, and a cruddy, herky-jerky stop motion animation wormoid thingie that's only quickly glimpsed at the very end of the movie, this extremely clunky, amateurish and hence quite delectably dreadful would-be scarefest commits all the necessary bad film missteps to qualify as a real four-star stinkeroonie.","label":1,"predicted":0}
{"review":"Michael Dudikoff stars as Joe Armstrong a martial artist who fights ninjas who are stealing weapons from the U.S Army, in this entertaining yet admittedly brainless martial arts actioner, which is hampered by too many long pauses without action, but helped by some high energy action setpieces as well as Steve James' performance.","label":0,"predicted":1}
{"review":"I guess I do not have too much to add. I found the comedy to still be funny after more than ten years since it came out.<br \/><br \/>The one thing that I did notice was the music during the dialogue to be distracting and often made the movie very hook than it should have been. The use of songs is fine during the movie but the orchestral background is too busy, too contrived and if the movie was ever to be edited for DVD, I would seriously recommend that the background music be toned down to an almost inaudible level. It has cheapened the overall feel for the whole film and I can see subconsciously why a lot of people have passed it up.<br \/><br \/>The film had a lot of levels working for it on the script, plot and comedy level. It is too bad that the producer and director felt they needed the musical schlock to enhance the mood. Now knowing this, I find it hard to watch and I quietly curse whoever was involved with the musical editing in the film. It had all the subtlety of a jackhammer.","label":1,"predicted":0}
{"review":"E. Elias Merhige's existentialist experiment in the enduring is definitely one hell of a boring watch. This is like something Alexander de Large was forced to watch in \"A Clockwork Orange.\" But, despite just how unwatchable this film really is, it is a success.<br \/><br \/>If you are reading this and have not already seen the film, then it is too late. For me, at least, the payoff (after 3 separate viewings with lots of break in between mind you) was seeing the list of characters *after* the story was told. That's when the simple message hit home. But i wonder if Merhige could have told a 5 minutes story in about 30, instead of 78.<br \/><br \/>However, seeing as how the cast of credits is displayed prominently on the front page for this movie, the cat is already out of the bag and you surely will only appreciate this film if you appreciate existentialist film making from the early 20th century. Even then, you might puke.<br \/><br \/>4\/10 (but i commend Merhige for crafted a piece of art, even if it is unwatchable)","label":1,"predicted":0}
{"review":"Dustin Hoffman's debut feature isn't as bad as it's reputed to be; a Spanish\/Italian co-production filmed in Italy with the director using the pseudonym \"Dan Ash\"(!), the film is uneven but generally diverting and deals with a plethora of shady characters in search of a $1,000,000 hidden by gangster Cesar Romero (who, despite being third-billed - after Elsa Martinelli and Hoffman himself - expires before the credit sequence has even rolled!).<br \/><br \/>Hoffman's performance, obviously, is nowhere near as nuanced as in later films but manages to dodge embarrassment by playing what basically amounts to an amiable klutz - an accident-prone American treasury agent of Sicilian descent (named Puzzu, which nobody seems to be able to get right!) sent out by his firm to retrieve the money and told to remain \"inconspicuous\" but, instead, is forever getting into trouble - though he ultimately proves surprisingly resourceful by finding the loot, foiling the crooks and winning the girl (Martinelli as Romero's daughter, who's somewhat wasted here)!! <br \/><br \/>Still, the film's best moments are provided by suave gangster Riccardo Garrone: apart from his would-be hard-boiled persona and the hilarious use of dialect, he's flanked by a trio of nitwits who more often than not prove a hindrance in the fulfillment of his various schemes! Also, in view of the story being set in Rome, it's odd that the police officer investigating the case is a Spaniard (doubtless an exigency of the co-production deal)! <br \/><br \/>Along the years, I've missed out on Hoffman's other Italian comedy - ALFREDO, ALFREDO (1972) - a number of times (I guess, mainly, because Leonard Maltin only rates it *1\/2 in his \"Movies & Video Guide\"...but, then, MADIGAN'S MILLION gets a BOMB!); with Pietro Germi directing and co-starring the luscious Stefania Sandrelli, the credentials of that film are certainly more respectable, and I really hope it turns up again on Italian TV soon...","label":0,"predicted":1}
{"review":"Rocketship X-M should be viewed by any serious movie buff for the following reasons:<br \/><br \/>1) It is one the first -- and the few -- movies not to have a happy ending. Doubtless the effect was more profound in post-World War II America than it would be today, but nonetheless the sad ending adds to the film's message.<br \/><br \/>2) It is also one of the first movies to deal with space travel in a serious fashion, using space as a valid setting for drama. The lack of scientific background notwithstanding, the movie stands on its own as dramatic fare. It's not so much a space drama as it is a drama set in space.<br \/><br \/>3) The anti-nuclear war message is delivered in a serious manner that is not lost in sfx involving large grasshoppers, men, or animal. The effect of Martian society from nuclear devastation is starkly and frankly presented. The fact that the survivors from the expedition crash land and as such are unable to preach the lesson learned on Mars adds another element of sadness to the tragic ending.<br \/><br \/>Sterno says take a ride on Rocketship X-M.","label":0,"predicted":1}
{"review":"Obviously made on the cheap to capitalize on the notorious \"Mandingo,\" this crassly pandering hunk of blithely rancid Italian sexploitation junk really pours on the sordid stuff with a commendable lack of taste and restraint: The evil arrogant white family who own and operate a lavish slave plantation spend a majority of the screen time engaging in hanky panky both each other and their various slaves. Director Mario Penzauti and screenwriter Tecla Romanelli cram this fetid filth with a teeming surplus of sizzling sleaze: we've got nasty rape, interracial copulation (one white lady makes wild love to a muscular black stud while he's tied to a cross), copious female nudity, brutal whippings, vile degradation, lots of lurid soft-core sex, and a severely twisted tragic surprise ending that mixes elements of incest, murder and miscegenation in a questionable attempt at making a statement about the horrid inhumanity of slavery. Special kudos are in order for foxy brunette actress Paola D'Egidio, whose lusty and uninhibited portrayal of depraved and lascivious wicked bitch Rhonda positively burns up the screen. Moreover, Marcello Giombini's funky, throbbing tribal score hits the groovy spot. Maurizo Centini's fairly polished cinematography likewise does the trick. A satisfyingly seamy chunk of slimy swill.","label":1,"predicted":0}
